# PHPとは
PHPとは、"PHP: Hypertext Preprocessor"の略です(再帰)
まず、"Hypertext"とは、HTML(Hyper Text Markup Language)のことです。
次に、"Preprocessor"とは、"Pre"が前、"Processor"が処理機なので前処理するもの、程度の意味です
要は、HTMLを処理するもの、という名前です。

HTML講習会でやったように、普通HTMLはブラウザで処理されます。では、前とはどこの事なのでしょうか

それを考えるには、世の中のWebサイトがどういう仕組みで動いているかを知る必要があります。
普段僕たちがWebサイトを見るときの登場人物は3つです

1. ユーザ(僕たち)
2. ブラウザ(僕たちが見てるもの)
3. サーバ(？？？)

1.と2.はわかると思うので、3について

## サーバとは
サーバ(Server)とは、"Serve"するもの、つまり提供するもの、みたいな意味です。
何を提供するかと言えば、お察しの通り(？)Webページです。HTMLやCSS、JSをブラウザに提供してくれます。
(正確にはこの機能はWebサーバだが、今回はWebの話なのでサーバと省略)

例えばYahoo!のトップページを見たいとユーザが思い、ブラウザにhttp://yahoo.co.jp と打ち込んだとき、
ブラウザは"yahoo.co.jp"のサーバにWebページをください、と言いサーバはそれを返します。

todo: 図が入る予定

なぜサーバが必要なのでしょうか？今まで皆さんは自分のパソコン上で自分が書いたHTMLを自分のパソコン上で
自分で表示していましたよね？しかし、世の中のWebサイトは自分しか見れないのでは意味がありません。
よって、サーバという仕組みを作り、いろんな人がWebサイトを見られるようにしたのです。


話を戻しますが、ブラウザの前に行われる処理がどこで行われるかわかりましたか？はい、サーバで行われます。
今まで皆さんが書いていたHTMLやCSS,JSはユーザのブラウザでプログラムが動き、実行されていました。
それに対し、PHPはサーバ側で動き、その結果をブラウザに送信する用のプログラミング言語です。

ちなみにブラウザで動くものはユーザから見て手前にあるのでフロントエンド、サーバで動くものは奥なのでバックエンドと呼びます。
PHPはバックエンドで動く用に作られたプログラミング言語です。


バックエンド用に作られはしましたが、もちろんそれ以外の用途でも使えます。人は転用が得意です。

そこで、まず自分のパソコンにPHPが動く環境を用意して簡単なPHPプログラミング言語をしてみましょう。