<template lang="md">
# JavaScriptとは

## このページについて

このページでの目標は、JavaScriptとは何か、がなんとなくわかることです。

## JavaScriptとは

### とりあえずWikipedia

wikipediaさんによると、

> プログラミング言語のひとつ
> プロトタイプベースのオブジェクト指向スクリプト言語

とのことです。
つまりどういうことかというと、
「プロトタイプ」というものを基礎として「オブジェクト」を使うような、
何かアプリを作るために主に使われる「プログラミング言語」ということだと思います。
たぶんこれを読んでも、は？？？わからないが？？？？という感じだと思います。もうちょっと説明するので許してください。

### ネットワーク局でのJavaScript

私たち(ネットワーク局)は、Webページを作ることが最大の目的として存在しています。
そのWebページを作るためにHTMLとCSSを知ったと思いますが、この2つだけだと思った通りの「動き」が作れない時が多々あります。

例えば、ハンバーガーメニューのように何か「ボタン」をクリック(スマホなどの場合タップ)することで「メニュー」が出てくるようなもの。
例えば、少しページを下にスクロールすると文字や画像が綺麗な装飾とともに出現するような仕組み。
例えば、Webページを開いたときに1/10程度の確率で何か別の画像が出現したり、ないしは別のページに飛ばされたりするような仕組み。

こういった物は、HTMLとCSSのみでは作ることは不可能でしょう。
(本気を出せば作れるようなものもありますが、HTML,CSSの本来の目的からは外れてしまうことが多いです。)
そのために私たちはJavaScriptを使います。これを使うことで、例として挙げた上の3つは実装することができます。
(本旨からは逸れますが、JavaScriptを使ってブラウザゲームを作ることもできます)

### つまり?

つまり、JavaScriptとは何か、を私たちをターゲットに説明するとしたら、

「HTMLとCSSだけでは作ることのできないWebページを作るために使う言語の1つ」

ということになります。

## プログラミング言語とは

HTML,CSSとは違い、JavaScriptはプログラミング言語と呼ばれるものです。

HTMLでは、タグを上から順に(また外側から順に)配置することで、ページの構造を作ってきました。

CSSでは、タグやクラスなどの「一定のタグの集合」に対してその表示方法などを定めることで、ページの装飾を施しました。

JavaScriptでは、コンピュータ(またはブラウザ)にしてほしい「処理」を上から順に書くことで、
その「処理」を実行してもらい、Webページをさらに豊かなものにすることができます。

### 何ができるのか

JavaScriptでは、例えば以下のようなことができます。

- コンソールに何か文字列を出力する

    GoogleChromeでF12キーを押すなどして、コンソールを開き、以下の文字列を(そのまま)入力してみてください。コピペでも大丈夫です。

``` javascript
    console.log('Hello World');
```

    すると、「Hello World」という文字がコンソールに出現したと思います。
    その下の行には「undefined」と表れていると思いますが、ひとまずそれは無視しておいてください。
    このように、コンソールに何か特定の文字列や数値を表示させることができます。

- 数値の計算をする

    コンピュータはとても計算が早いです。「1+1」はおろか「4567.41343 * 123153.9876」みたいな計算も高速で行ってくれます。

- 変数,定数を定義する

    先ほど「4567.41343 * 123153.9876」も計算してくれる、と言いましたが、計算してくれただけではほとんど意味がありません。
    コンピュータは「記憶」ということを自動でしてくれないからです。
    「4567.41343 * 123153.9876」の計算結果を記憶してください、とお願いをする(処理を書く)ことで初めて記憶をしてくれます。
    このほかにも、何か適当な文字列「くぁｗせｄｒｆｔｇｙふじこｌｐ」も記憶してくれます。
    「変数の定義」「定数の定義」によって、この「記憶」を実現させることができます。

- 繰り返し処理を行う

    例えば、「Webページにpタグを100個置く」という動作は人力でやりたくありません。
    100ならまあ…という人もいるかもしれませんが、それなら1000個ならどうでしょう?10000個は?100000個は?
    こういった「一定の動作」を繰り返すこともJavaScriptで実装できます。
    それどころか、「繰り返した回数」を記録してちょっとずつ動作を変えることもできます。なんて便利なんでしょう。

- 条件分岐を行う

    例えば、「適当な入力欄をWebページにおいて、その入力欄に"正解"が入力されたら別のページに飛ばす」みたいな処理がしたくなるかもしれません。
    そういったときに、「入力欄に"正解"が入力される」をトリガーとして条件分岐を行わせることができます。

他にも様々なことができますが、ひとまず羅列はこのくらいにしておきます。
基本的なことしかできない、と思われる人もいるかもしれませんが、
その「基本的なこと」を複雑怪奇に組み合わせることでものすごい処理を行うことができるようにもなるかもしれません。

[次へ](howTo)

[目次に戻る](../basic/)
</template>
