<template lang="md">
<small>こもり 2018/8/31</small>

# 型と変数宣言

## このページについて

このページでの目標は、JavaScriptで使う値の種類を把握し、定義できるようになることです。

## 型について

前までのページでは、「1」「2」などの数字や「'neko'」などの文字列、「true」という謎の文字が少し出てきました。
そういったものが他にあるのか、どういったときに使うのかは非常に重要な観点です。
ということで、JavaScriptでどのような値が使えるかを紹介します。

1. 数値

	-2,-1,0,1,2,3,...などの整数だけでなく、1.123や3.14などの少数も使うことができます。
	また、2進法,8進法,16進法や「3.2E+5」という書き方もできます。
	(2進法などの説明やどうやって書くかは省略します)

	プログラミングがわかる人向けに言うと、JavaScriptでの少数はdouble型です。
	また、「NaN」という数ではないことを表す値も数値として扱われます(???)

2. 文字列

	「Hello」などの文字列も扱うことができます。
	しかし、単に「Hello」と書くと「Hello」という変数とみられてしまいます。
	文字列ですよーとコンピュータに伝えるには、「"Hello"」や「'Hello'」のように、
	ダブルクォーテーションやシングルクォーテーションで文字列をくくる必要があります。
	
	HTMLでは「"Hello"」の書き方が推奨されていますが、
	JavaScriptでは「'Hello'」の書き方が推奨されています。
	
	また、「1」という文字列(数値ではないことに注意)も、「'1'」と書くことで表すことができます。

3. 真偽値

	例えば「2>1」という不等式が成り立つかどうか、を知りたいときがやってくるかもしれません。
	JavaScriptではそういったケースも想定されています。
	正しい、ということを「true」で、正しくない、ということを「false」で表します。
	
	コンソールで「1000>1+1」と書くと、この不等式は正しいので「true」と表示されます。
	コンソールで「-2>10」と書くと、この不等式は正しくないので「false」と表示されます。

4. そのほか

	これ以外に「null」と「undefined」があります。それぞれ「例外の値」「未定義の値」を表します。
	
JavaScriptでは上記の4種類の値を用いることができます。

## 変数宣言について

4種類の値が使えることは分かりましたが、じゃあどうやって持ってくるかがわかりません。
なにもせずそのまま「1+1」や「'neko'」や「true」と書いてもよいですが、
このままでは何も意味をなさないことが多々あります。

そこで「変数宣言」ということをします。
変数宣言を行うことで、値を適当な名前で保持し、また別の場所で使うことができます。

変数宣言の方法は以下の3種類が存在します。

- 「var」

	昔はよくつかわれていた変数宣言の方法です。(というよりは昔はこれしか変数宣言の方法がなかった)
	変数(VARiable)を定義します。

	以下のように書くことでvarによる変数宣言を行うことができます。
	「var (変数の名前) = (変数の値);」
	
	例えば「var hoge = 100;」と書くと、100という数値を持つ、名前が「hoge」の変数を定義することができます。

	例えば「var str001 = 'Good Morning!'」と書くと、「Good Morning!」という文字列を持つ、
	名前が「str001」の変数を書くことができます。

	変数の名前についての注意ですが、名前の先頭に数値やアンダースコア(_)はつけないでください。
	つまり、「0hoge」や「_aaa」は変数の名前にしないでください。

- 「let」

	最近出てきた変数宣言の方法です。
	これも「var」と同じく変数を定義できますが、この方法は「ブロックスコープ」内に定義する、という点が異なります。
	ブロックスコープってなんだよ…となると思いますがひとまず無視してください。
	とりあえずは「var」よりは「let」を使う方が良いと思います。

- 「const」

	これも最近出てきた方法です。
	定数(CONSTant)を定義します。
	これで定義した定数にもう一度何か値を代入した場合、errorが出ます。
	のちに説明する「配列」や「オブジェクト」の定義にはこれを使うことが多いです。

``` javascript
//JavaScript

var num = 100;
var str = 'Hello';
var bool = true;

let i = 0;

const pi = 3.14;
```

以上の3種類の変数宣言が存在します。最初は違いが分からないかと思いますが、
使っていくにつれ分かっていくかもしれません。

[戻る](jsBasic02_howTo)

[次へ](jsBasic04_operation)

[目次に戻る](../basic/)

</template>
