<template lang="md">
<small>こもり 2018/8/31</small>

# オブジェクト

## このページについて

このページでの目標は、オブジェクトについて理解することです。

## オブジェクトとは

オブジェクトとは、変数(や「関数」と呼ばれるもの)を持つことができる型です。

オブジェクトは、よく何かの「もの」に例えられます。
たとえば、「りんご」というオブジェクトがあったとします。
「りんご」は現実として赤い「色」をしている。種類としては「果物」である。
など、色々な性質、特性(プロパティ)を持っています。
これを、JavaScriptでは以下の様に表します。

「りんご = \{色 \: 赤, 種類 \: 果物\}」

また、りんごの色を知りたいときは「りんご\.色」と書くことで「赤」を取り出すことができます。

実際にこれをJavaScriptで書くと、例えば以下のようになります。

``` javascript
//JavaScript

//初期値としてプロパティを持つオブジェクトの定義
const apple = {
	color : 'red'
};

//オブジェクトにプロパティを追加
apple.kind = 'fruit';

//オブジェクトのプロパティにアクセス
console.log(apple.color); //red
```

## オブジェクトについて

「\{\}」を使うことで、型がオブジェクトとなる変数を変数宣言で定義することができます。
最初から何らかの「性質」(先ほどの例「りんご」で言うと「色」や「種類」のこと)を持っていてほしい場合は、
「\{\}」の中に「性質の名前 \: 値」などと書くことで定義ができます。
この「性質」とその値を「プロパティ」と言います。
複数のプロパティを定義したい場合は「\,」で区切ってください。
(区切らない場合はエラーが出ます。)

オブジェクトのプロパティは、
「オブジェクト\.プロパティ」または「オブジェクト\[プロパティ\]」
で値を入力したり出力したりすることができます。
新しくプロパティを定義することができますし、既に定義したプロパティをこれで使うこともできます。

また、オブジェクトのプロパティには「関数」と呼ばれるもの(後で説明します)も定義することができます。
これをオブジェクトの「メソッド」と言います。

- オブジェクトにおけるconstでの宣言

	型のページで、「const」での変数宣言は「定数」を定義する、と言いました。
	constで定義したオブジェクトは、つまり「定数」であるオブジェクトとなります。
	しかし、この定数のオブジェクトに新しくプロパティを追加してもエラーは起きません。
	これは、constで定義したオブジェクトが(言わば)外骨格である「\{\}」が変わらないよ、
	ということを表しているからで、その括弧の中身がいくら変わろうと問題がないからです。

	新しくオブジェクトを代入しなおすなどで「\{\}」が入れ替わってしまうときはきちんとエラーが起きます。
	このエラーが起きるのは基本的に想定外だと思いますので、
	オブジェクトの定義にはconstを使うことをお勧めします。

	``` javascript
	//JavaScript

	const object = {
		0 : 0,
		1 : '1',
		hoge : 'neko'
	};

	object.hoge; //neko
	object.0 //error
	object[hoge] //error
	object[0] //0
	object['0'] //0
	object['hoge'] //neko

	//プロパティを増やす
	object.[3] = 123456;
	object.hige = 'inu';
	object['po'] = 'poteto';

	//メソッドを増やす
	object.foo = x=>x*x;

	//メソッドを使う
	object.foo(4) //16

	//メソッドを持つオブジェクト
	const obj = {
		func : function(a){return a},
		sum(a,b){return a+b},
		product : (a,b)=>a*b,
	}
	```

## オブジェクト指向について

JavaScriptは「オブジェクト指向」の言語だと最初のページに言ったと思います。
この「オブジェクト」が今説明したものです。

「オブジェクト指向」とはどういうことかというと、JavaScriptで使う色々なものがオブジェクトである、ということです。
例えば次に説明する「配列」も(Arrayという)オブジェクトですし、
他にもMath,String,Numberといった既に定義された(便利な)オブジェクトが存在します。

こういった既にあるオブジェクト(ビルトインオブジェクトと言います)のプロパティ(やメソッド)には、
皆がよく使うであろう値や関数が搭載されています。
これらを(調べるなどで見つけて)使えるようになると、色々なことが簡単にできるかもしれません。

[戻る](jsBasic04_operation)

[次へ](jsBasic06_array)

[目次に戻る](../basic/)
</template>
