<template lang="md">
<small>こもり 2018/8/31</small>

# 反復処理

## このページについて

このページの目標は、反復処理を使えるようになることです。

## 反復処理を扱う理由

プログラミングを行う際、「あることを1000000回繰り返す」とか、「一定条件を満たすまで永遠と繰り返す」など
凡そ人間の手作業では不可能な回数の(ほとんど同じような)処理を要求される可能性があります。
「100回繰り返す」程度ならまだ100個同じような文を書いて処理をしてもらえばよい……と思う人もいると思いますが、
「1000000回繰り返す」などになると大半の人が諦めると思います。

このような処理を行うためにJavaScriptで実装されているものとして、「for文」「while文」等があります。
これらを使うことで、上で挙げたような処理も簡単に書けるようになります。

## 反復処理

ここでは「for文」、「while文」、「for...in文」を紹介します。

- for文

	for文は、一定回数の反復処理を実行するときによく使われる文です。
	何回繰り返して処理を行うかわかっている場合に有効です。

	「for\(A\;B\;C\)\{D\}」と書きます。A,B,C,Dはそれぞれ処理が書かれた文を表します。
	Aを初期化式、Bを条件式、Cを加算式と呼びます。

	「for\(let i \= 0\; i \< N\; i\+\+\)\{\~\~\}」という形で書くことが多いです。

	for文は以下の順番で実行されます。

	1. Aが実行されます。
	1. Bがtrueであるかfalseであるかを評価します。
		1. Bがtrueならば、Dが実行されます。
		1. Bがfalseならば、for文の処理は終了になります。
	1. Cが実行されます。
	1. Aが実行されます。(最初に戻る)

	```javascript
	//JavaScript

	let primes = [2,3,5,7,11,13,17,19,23,29];

	//primesの各要素を(最初から順番に)コンソールに出力する
	for(let i = 0; i < primes.length; i++){
		console.log(primes[i]);
	}
	```

- while文

	while文は、指定された条件を満たしている限り反復して処理を実行するときによく使われる文です。
	「○○まで繰り返す」のような処理を行うときに有効です。

	「while\(A\)\{B\}」と書きます。A,Bはそれぞれ処理が書かれた文を表します。
	Aを条件式と呼びます。

	while分は以下の順番で実行されます。

	1. Aがtrueであるかfalseであるかを評価します。
		1. Aがtrueならば、Bが実行されます。
		1. Aがfalseならば、while文の処理は終了になります。
	1. Aがtrueかどうかを評価します。(最初に戻る)

	注意点として、while分はいわゆる「無限ループ」が発生しやすいです。
	つまり、Aが常にtrueと評価されてしまい、Bが永遠と実行され続ける…という状況が起こりやすいです。
	無限ループとなる文をWebページで実行してしまった場合、そのWebページを閉じるのにも一苦労なので注意してください。

	```javascript
	///JavaScript

	let i = 0;
	let j = 0;
	
	while(i < 50){
		i += j;
		j++;
		console.log(i);
	}
	/*
	以下の数字が(上から順に)コンソールに出力される
	0
	1
	3
	6
	10
	15
	21
	28
	36
	45
	55
	*/
	```

- for...in文

	for...in文は、オブジェクトが持つ(列挙可能な)全プロパティに対して処理を行います。
	配列でないオブジェクトではfor文で反復処理を行うのは簡単ではありませんが、
	これを使うことで簡単に実行できるようになります。

	「for\(A in B\)\{C\}」と書きます。
	Aは変数名、Bは反復したいプロパティを持つオブジェクト、Cは処理が書かれた文です。

	for...in文は、オブジェクトBが持つプロパティpに対して、「pをAに代入してCを実行する」を順番に実行します。

	```javascript
	///JavaScript

	let obj = {
		a : 1,
		b : 10,
		c : 100,
		hoge : 'nya'
	}

	for(let prop in obj){
		console.log(prop);
		console.log(obj[prop])
	}
	/*
	以下の値がコンソールに出力される
	a
	1
	b
	10
	c
	100
	hoge
	'nya'
	*/
	```
[戻る](jsBasic06_array)

[次へ](jsBasic08_if)

[目次に戻る](../basic/)
</template>
