<template lang="md">
<small>こもり 2018/8/31</small>

# 配列

## このページについて

このページの目標は、配列について理解することです。

## 配列とは

配列とは、Arrayオブジェクトと呼ばれる特別なオブジェクトの一種であり、
値を「1から順番に並べる」ことができるものです。

例えば、「○○さんの好きなものランキングTOP3」や「p要素のbackground\-colorに適用させる色を順番に並べたもの」、
「20以下の素数を小さい順に並べたもの」などを配列で表すことができます。

「20以下の素数を小さい順に並べたもの」は、例えば以下のように書きます。

```javascript
//JavaScript

let primes = [2,3,5,7,11,13,17,19];

//20以下の素数の数を見る
let primeNumTo20 = primes.length; //8

//小さいほうから4番目の素数を取り出す
console.log(primes[3]); //7

//もう一つ素数を追加する
primes[8] = 23;

//23以下の素数の数になる
console.log(primes.length); //9
```

## 配列について

「\[\]」を使うことで、型が配列となる変数を変数宣言で定義することができます。
定義する配列に初期要素が必要な場合は、「\[\]」の中に順番に(「\,」で区切って)その要素を書くことで定義できます。

配列の要素は、先頭から順番に「配列の名前\[見たい要素の場所(添字とも言います)(0,1,2,...)\]」で値を入出力できます。
順番を表す数字は非負整数です。0から始まることに注意してください。

(これは、つまり非負整数を名前として持つオブジェクトのプロパティを扱っていることになります)

また、配列に入っている要素の数は、「length」プロパティで見ることができます。
(厳密には、lengthプロパティは「最後に入っている要素の添字+1」を出力します)
つまり、「配列の名前\.length」で配列に入っている要素の数を出力できます。

lengthプロパティに適当な非負整数を入力することもできます。
入力した場合、その配列は指定された数だけ要素を持つ配列に拡張(または縮小)されます。

また、配列もオブジェクトなので、非負整数以外の値を名前として持つプロパティを定義することが可能です。

``` javascript
//JavaScript

let hoge = [];
let arr = [1,2,3];

console.log(arr[0]); //1
arr[2] = 5; //arr = [1,2,5]

console.log(arr.length); //3
arr.length = 1; //arr = [1]
arr[4] = 0; //arr = [1,empty,empty,empty,4] 
console.log(arr.length); //5

arr.po = 'neko';
```

## メソッド

配列は、その「親」(prototypeといいます)としてArrayオブジェクト、というビルトインオブジェクトを持っています。
このArrayオブジェクトは様々なメソッドが定義されており、
これらを有効に使うことで大体どうにかなる、ということも多いです。

それらのメソッドのうち、いくつかを紹介します。

- push(a1,a2,...,aN), unshift(a1,a2,...,aN)

	配列の末尾(先頭)にa1,...aNを要素として追加するメソッドです。
	要素として追加する処理のほかに、出力として(要素が追加された後の)配列のlengthプロパティを出力します。

	```javascript
	//JavaScript

	let hoge = [1,2];
	let i = hoge.push(10,9,8);

	//hoge = [1,2,10,9,8]
	//i = 5

	let hige = [2,3];
	let j = hige.unshift('a','b');

	//hige = ['a','b',2,3]
	//j = 4
	```

- pop(), shift()

	配列の最後(最初)の要素を取り出すメソッドです。
	配列からその要素がなくなるほかに、取り出された要素が出力されます。

	```javascript
	//JavaScript

	let arr = [10,20,30,4,50];
	let r = arr.pop();

	//arr = [10,20,30,4]
	//r = 50

	let a = arr.shift();

	//arr = [20,30,4]
	//a = 10
	```

- indexOf(el,index)

	配列の要素がelで、添字がindex以上である最小の添え字を出力するメソッドです。
	elである要素がない場合、-1を出力します。
	indexは初期値として0が与えられています。

	```javascript
	//JavaScript

	let arr = [2,3,5,7,11];
	let i = arr.indexOf(7); //4

	arr = [1,0,1,0,0,0,1];
	let j = arr.indexOf(1) //0
	let k = arr.indexOf(1,1); //2
	let l = arr.indexOf(1,4); //6
	```

### 多次元配列

配列の要素に配列やオブジェクトを定義することができます。(同様にオブジェクトのプロパティにも可能です)
これによって、多次元配列(添字が2つ以上必要になる配列)を定義できます。

```javascript
//JavaScript

let arr = [[0,1,2],[3,4,5],[6,7,8]];
console.log(arr[1]); //[3,4,5]
console.log(arr[2][0]); //6
```

[戻る](jsBasic05_object)

[次へ](jsBasic07_for)

[目次に戻る](../basic/)
</template>
