<template lang="md">
<small>こもり 2018/8/31</small>

# 練習問題

## このページについて

このページの目標は、JavaScript基礎の内容を理解しているか確認することです。

## 練習問題

### 1\. 素数

以下のものをJavaScriptで作成してください。

1. 1以上100以下の素数をコンソールに(小さいものから)出力する処理
1. 自然数Nに対して、1以上N以下の素数をコンソールに出力する関数
1. 自然数Nに対して、1以上N以下の素数を小さい順に並べた数列(と解釈できるもの)を出力する関数
1. 自然数Nに対して、Nの素因数分解の指数部を(小さい素数順に)並べた数列(0,0,0,...は省略してもよい)を出力する関数

### 2\. フィボナッチ数

以下のものをJavaScriptで作成してください。

1. フィボナッチ数(ここでは1,1,2,3,5,...と始まる数列とします)を小さい順に100個出力する処理
1. 10000以下のフィボナッチ数を小さい順に出力する処理
1. 自然数N,Mに対して、N以下のフィボナッチ数を最大M個並べた数列を出力する関数

### 3\. カウンター

以下のものをJavaScriptで作成してください。

1. 実行した回数を出力する関数
1. 実行した回数を出力する関数。ただし、文字列「reset」を入力すると実行した回数が0に戻る
1. 実行した回数を出力する関数。ただし、「reset」の仕様の他に、自然数を入力するとその回数だけ実行回数が増える
	```javascript
	///JavaScript

	func(); //1
	func(); //2
	func(10); //13
	func('reset'); //0
	func(2); //3
	```

### 4\. 最大値最小値

以下のものをJavaScriptで作成してください。

1. 実数a,bに対して、「aとbのうち大きいほう(同値の場合a)」を出力する関数
1. 実数a,bに対して、「aとbのうち小さいほう」を出力する関数
1. 実数a,b,cに対して、「aがbより小さいならfalse、そうでないならa以上b以下の値でcに一番近い値」を出力する関数
	```javascript
	//JavaScript

	func(1,2,3); //2
	func(2,1,3); //false
	func(-10,10,7); //7
	func(9,10,0); //0
	```
1. 実数a1,...,aNに対して、「a1,...,aNの中で一番大きい値」を出力する関数(ただしNはいくつかわからない)


[戻る](jsBasic09_func)

[目次に戻る](../basic/)
</template>
