<template lang="md">
<small>こもり 2018/8/31</small>
	
# 演算

## このページについて

このページでの目標は、JavaScriptの簡単な演算を理解することです。

## 演算

前ページで数値や文字列を扱うことができました。
そこで、今ある数値や文字列から新しい数値,文字列を生み出す操作、「演算」を紹介します。
演算を使うことで、さらにいろいろなものを生み出したり操作したりでき、
複雑な処理への一歩を踏み出すことになります。

## 演算とは

そもそも「演算」とは何でしょうか。
演算とは、1つ以上の値(の組)から適当な規則に従って値を主力する操作のことです。
例えば加法(足し算)は演算です。「1+2」は1と2という2つの数値の組から、
「足す」と言う規則に従って特定の値3を出力しますよ、ということなのです。

「演算」という操作は「演算子」という記号を使って表されます。
加法については、「+」という記号を使うことで足し算をしていますよ、と表しています。

1つの数値から1つの数値を出力する演算を表す演算子を「単項演算子」

2つの数値から1つの数値を出力するものを「二項演算子」

3つの数値から1つの数値を出力するものを「三項演算子」

と言います。

## 算術演算子

算術演算子は、加減乗除などの、2つの数値から1つの数値を出力する演算を表します。
(特殊な例として、インクリメントとデクリメントは1つの数値から1つの数値を出力します)

加減乗除(つまり、足し算、引き算、掛け算、割り算)はそれぞれ「+」,「-」,「*」,「/」
で表します。

他の算術(二項)演算子には「%」と「\*\*」があります。
「%」は剰余(割り算の余り)を、「\*\*」は累乗を表します。

つまり、例えば「10%3」は10を3で割った余りである「1」が出力され、
「2\*\*5」は2の5乗である「32」が出力されます。

``` javascript
/// JavaScript

10 + 34 //44
10 - 34 //-24
10 * 34 //340
34 / 10 //3.4
34 % 10 //4
3 ** 4 //81
```

- インクリメントとデクリメント

	特殊な算術演算子として「インクリメント」と「デクリメント」があります。
	これらは単項演算子です。それぞれ「++」と「--」で表します。

	インクリメントは、数値を持つ変数「x」に対して例えば「x++」と書き、この場合は「xを出力した後でxに1を足す」という操作を表します。
	また、「++x」と書くこともでき、この場合は「xに1を足した後でその値を出力する」という操作を表します。

	デクリメントは、同じように「x--」、「--x」と書きます。
 
	``` javascript
		//JavaScript

		let x = 10;

		console.log(x++); //10
		console.log(++x); //12

		let i = 100;

		console.log(--i); //99
		console.log(i--); //99
	```

## 代入演算子

代入演算子は、変数に値を「代入」する操作を表します。「\=」で表します。
「\=」は代入を表す演算子であって、等号を表す演算子ではないことに気を付けてください。

例えば「a \= 5」は、変数aに数値5を代入する、ということを表します。
つまり、この操作が行われてからは、またほかの代入が行われない限り、
「a」という名前の変数は「5」という数値を意味することになります。

``` javascript
//JavaScript

let i = 10;
i = 4;
console.log(i); //4
```

- 複合代入演算子

	「\+\=」のように、「\=」の前に別の記号を付けて特殊な代入方法を表す演算子を複合代入演算子といいます。
	たとえばこの「a \+\= 10」は、「aに10を足す(値を10加算したものに更新する)」ということを表します。
	つまり、「a \+\= b」と「a \= a \+ b」は同じ意味を表します。

	``` javascript
		//JavaScript

		let i = 0;
		i += 1; //i = 1 ... i++と同じ
		i -= 10; //i = -9
		i *= -2; //i = 18
		i /= 3; //i = 6
		i %= 4; //i = 2
		i **= 5; //i = 32

	```

## 比較演算子

比較演算子は、二つの値を比較したその結果に応じて「true」ないしは「false」を出力する演算を表します。
たとえば「3 > 1」は「3は1より大きいかどうか」の比較を表し、実際に3は1より大きいので「true」を返します。
「3は1以上か」を表すためには「>=」を使ってください。「=>」ではありません。(別の意味になってしまう)

「より小さい」や「以下」を表す際も同様です。

``` javascript
//JavaScript

3 > 2; //true
10 >= 11; //false
9 < 1; //false
99 <= 99; //true
```

- 等価と非等価

	比較演算子には「aとbは等しいかどうか」を表す演算子もあります。
	しかし、「\=」は代入演算子として既に使われてしまっています。

	代わりに、「a \=\=\= b」や「a \=\= b」などと書くことで表すことができます。
	この「\=\=\=」と「\=\=」は、それぞれ「厳密に等しいかどうか」と「等しいかどうか」を表します。

	「厳密に」が実際どういうことを意味するかというと、
	「値」が等しいかどうかを見ると同時に「型」が等しいかどうかを見るようになります。

	たとえば、値としての「0」と文字列としての「\'0\'」を比較したとき、
	「\=\=\=」だと「false」が出力されますが、「\=\=」だと「true」が出力されます。
	また、「0」と真偽値としての「false」を「\=\=」で比較しても、なんと「true」が出力されます。

	また、「aとbは等しくないかどうか」を表すには、
	「\!\=\=」と「\!\=」を使います。前者が厳密な比較を行います。

	実際に等価の演算子を使う場合は、型の違いを理解するまでは
	「\=\=\=」と「\!\=\=」を使うとよいでしょう。

``` javascript
	//JavaScript

	1 == '1'; //true
	1 == 2; //false

	1 === '1'; //false
	1 === 1; //true
	1 === 0; //false

	0 != '1'; //true
	0 != '0'; //false
	0 != false; //false
	
	0 !== 0; //false
	0 !== '0'; //true
	0 !== false; //true
```

## 文字列演算子

今までは基本的に数値の演算を表す演算子を扱ってきましたが、
なんと文字列にたいしても演算を行うことができます。

文字列に対しては「\+」と「\+\=」を使うことができます。

文字列における演算子「\+」は「文字列を結合する」操作を表します。
例えば、「\'Hello\' \+ \'World\'」は「\'HelloWorld\'」を表しますし、
「\'123\' \+ \'456\'」は「\'123456\'」を出力します。

``` javascript
//JavaScript

'Hello ' + 'World'; //Hello World
'0101' + '1010'; //'01011010'

let str = 'cat is';
str += ' an animal'; //'cat is an animal'
```

## 論理演算子

論理演算子は、真偽値に対する二項演算子または単項演算子で、真偽値を出力します。

例えば、比較演算子を用いることで真偽値である「true」と「false」を出力したり、
変数に定義することで真偽値を扱うことができます。
真偽値が扱えるなら、察しの良い人は「PかつQ」,「PまたはQ」,「Pでない」を使いたい…と思う人もいると思います。

実際にその3つは使うことができます。それぞれ「\&\&」,「\|\|」,「\!」で表します。

「P \&\& Q」は「PかつQ」を表し、操作としては、簡単に言えば
「(それぞれ真偽値とした値について)PかつQを出力する」を表します。
詳細に言うと、「Pがfalse(型として厳密に等価である必要ではない)の場合はPを出力し、そうでない場合は
Qを出力する」という操作を表します。

「P \|\| Q」は「PまたはQ」を表し、操作としては、「PまたはQを出力する」を表します。
詳細に言うと、「Pがtrueの場合はPを出力し、そうでない場合はQを出力する」という操作を表します。

「\!P」は「Pでない」を表し、操作としては
「Pがtrueならfalseを出力し、そうでないならtrueを出力する」という操作を表します。

``` javascript
//JavaScript

true && true; //true
true && false; //false
false && false; //false
(3>1) && (1=='1'); //true

true || true; //true
true || false; //true
false || false; //false
false || 10; //10

!true; //false
!false; //true
!0; //true
```

[戻る](jsBasic03_type)

[次へ](jsBasic05_object)

[目次に戻る](../basic/)

</template>
