<template lang="md">
	
# 演算について

## このページについて

このページでの目標は、JavaScriptの簡単な演算を理解することです。

## 演算

前ページで数値や文字列を扱うことができました。
そこで、今ある数値や文字列から新しい数値,文字列を生み出す操作、「演算」を紹介します。
演算を使うことで、さらにいろいろなものを生み出したり操作したりでき、
複雑な処理への一歩を踏み出すことになります。

## 演算とは

そもそも「演算」とは何でしょうか。
演算とは、1つ以上の値(の組)から適当な規則に従って値を主力する操作のことです。
例えば加法(足し算)は演算です。「1+2」は1と2という2つの数値の組から、
「足す」と言う規則に従って特定の値3を出力しますよ、ということなのです。

「演算」という操作は「演算子」という記号を使って表されます。
加法については、「+」という記号を使うことで足し算をしていますよ、と表しています。

1つの数値から1つの数値を出力する演算を表す演算子を「単項演算子」

2つの数値から1つの数値を出力するものを「二項演算子」

3つの数値から1つの数値を出力するものを「三項演算子」

と言います。

## 算術演算子

算術演算子は、加減乗除などの、2つの数値から1つの数値を出力する演算を表します。
(特殊な例として、インクリメントとデクリメントは1つの数値から1つの数値を出力します)

加減乗除(つまり、足し算、引き算、掛け算、割り算)はそれぞれ「+」,「-」,「*」,「/」
で表します。

他の算術(二項)演算子には「%」と「\*\*」があります。
「%」は剰余(割り算の余り)を、「\*\*」は累乗を表します。

つまり、例えば「10%3」は10を3で割った余りである「1」が出力され、
「2\*\*5」は2の5乗である「32」が出力されます。

### インクリメントとデクリメント

	特殊な算術演算子として「インクリメント」と「デクリメント」があり、
	それぞれ「++」と「--」で表します。

	インクリメントは、数値を持つ変数「x」に対して例えば「x++」と書き、この場合は「xを出力した後でxに1を足す」という操作を表します。
	また、「++x」と書くこともでき、この場合は「xに1を足した後でその値を出力する」という操作を表します。

	デクリメントは、同じように「x--」、「--x」と書きます。
 
``` javascript
	//JavaScript

	let x = 10;

	console.log(x++); //10
	console.log(++x); //12

	let i = 100;

	console.log(--i); //99
	console.log(i--); //99
```

[次へ](object)

[目次に戻る](../basic/)

</template>
